<?php

/* @var $this \yii\web\View */
/* @var $content string */

use yii\helpers\Html;
use app\assets\RadugaAsset;
use yii\bootstrap\Modal;
use yii\helpers\Url;

RadugaAsset::register($this);
?>
<?php $this->beginPage() ?>
<!DOCTYPE html>
<html lang="<?= Yii::$app->language ?>">
<head>
    <base href="/">
    <meta charset="<?= Yii::$app->charset ?>">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <?= Html::csrfMetaTags() ?>
    <title><?= Html::encode($this->title) ?></title>
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
<!--    <link rel="shortcut icon" href="build/img/favicon.ico" type="image/x-icon">-->
<!--    <link rel="apple-touch-icon" href="build/img/apple-touch-icon.png">-->
<!--    <link rel="apple-touch-icon" sizes="32x32" href="build/img/apple-touch-icon.png">-->
    <link href="https://fonts.googleapis.com/css?family=Montserrat:300,400,500,600,700|Roboto:300,400,500,700&amp;subset=cyrillic-ext" rel="stylesheet">
    <?php $this->head() ?>
</head><!--/head-->

<body id="body">
<?php $this->beginBody() ?>

<div class="intro-wrapper">
  <div class="intro-line"></div>
</div>

<a href="/" class="logo">
  <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 229.97 109.76">
    <g id="Слой_2" data-name="Слой 2">
      <g id="Слой_1-2" data-name="Слой 1">
        <path
          class="cls-1"
          d="M55.18,48.74h0V47h0V44.21A7.47,7.47,0,0,1,50.87,43l-.33-.18a16.69,16.69,0,0,0-9.08-2.51,18.45,18.45,0,0,0-3.7.35,17.41,17.41,0,0,0-5.38,2.16l-.12.07a9.24,9.24,0,0,1-4.5,1.21h0a9.25,9.25,0,0,1-4.5-1.21l-.12-.07a17.43,17.43,0,0,0-5.38-2.16,18.46,18.46,0,0,0-3.7-.35,16.69,16.69,0,0,0-9.08,2.51L4.6,43A7.47,7.47,0,0,1,.28,44.21V47h0v3.4h0v2.83a16.69,16.69,0,0,0,9.08-2.51,14.13,14.13,0,0,1,1.7-.86A7.52,7.52,0,0,1,14,49.42a7.82,7.82,0,0,1,4.64,1.35,16.68,16.68,0,0,0,9.08,2.51,16.69,16.69,0,0,0,9.08-2.51,7.82,7.82,0,0,1,4.64-1.35,7.52,7.52,0,0,1,2.95.48,14.14,14.14,0,0,1,1.7.86,16.69,16.69,0,0,0,9.08,2.51V50.44h0Z"
        />
        <path
          class="cls-1"
          d="M47.34,8.12A27.75,27.75,0,0,0,2.9,40.1l.37-.21A19.94,19.94,0,0,1,14,37h.17a16.4,16.4,0,1,1,27.12,0h.17A19.94,19.94,0,0,1,52.2,39.9l.37.21a27.78,27.78,0,0,0-5.23-32Z"
        />
        <path
          class="cls-1"
          d="M81.7,44.66H76.17V12.51H81.7v3.37a5.19,5.19,0,0,1,2.58-2.79A10,10,0,0,1,89.13,12a11,11,0,0,1,8.28,3.48,12,12,0,0,1,3.34,8.65,12,12,0,0,1-3.34,8.65,11,11,0,0,1-8.28,3.48,10,10,0,0,1-4.84-1.08,5.18,5.18,0,0,1-2.58-2.79ZM88.39,17a7,7,0,0,0-7.1,7.1,7,7,0,0,0,7.1,7.1,6.55,6.55,0,0,0,4.91-2,7,7,0,0,0,2-5.07,7,7,0,0,0-2-5.07A6.55,6.55,0,0,0,88.39,17Z"
        />
        <path
          class="cls-1"
          d="M106.91,32.81a12.08,12.08,0,0,1-3.34-8.67,12,12,0,0,1,3.34-8.65A11,11,0,0,1,115.19,12a9.71,9.71,0,0,1,4.8,1.11,5.54,5.54,0,0,1,2.63,2.77V12.51h5.54V28.75a4.14,4.14,0,0,0,.39,2.1,1.43,1.43,0,0,0,1.31.62,8.18,8.18,0,0,0,1.15-.09v4.47a7.7,7.7,0,0,1-2.72.37,6.28,6.28,0,0,1-3.23-.74,4.29,4.29,0,0,1-1.89-2.81q-2.45,3.64-8,3.64A11,11,0,0,1,106.91,32.81ZM111,19.06a7,7,0,0,0-2,5.07,7,7,0,0,0,2,5.07,6.54,6.54,0,0,0,4.91,2,7,7,0,0,0,7.1-7.1,7,7,0,0,0-7.1-7.1A6.55,6.55,0,0,0,111,19.06Z"
        />
        <path
          class="cls-1"
          d="M165.22,40.42a7.92,7.92,0,0,0,2.58.37,3.54,3.54,0,0,0,2-.51,3.93,3.93,0,0,0,1.34-2l.6-1.66L162,12.51h5.58L174.44,30l6.41-17.53h5.58L176,39.54a11.11,11.11,0,0,1-2.49,4.15,7.85,7.85,0,0,1-5.58,1.94,9.26,9.26,0,0,1-2.72-.37Z"
        />
        <path
          class="cls-1"
          d="M205.87,32.81a12.08,12.08,0,0,1-3.34-8.67,12,12,0,0,1,3.34-8.65A11,11,0,0,1,214.15,12a9.71,9.71,0,0,1,4.8,1.11,5.54,5.54,0,0,1,2.63,2.77V12.51h5.54V28.75a4.14,4.14,0,0,0,.39,2.1,1.43,1.43,0,0,0,1.31.62,8.19,8.19,0,0,0,1.15-.09v4.47a7.7,7.7,0,0,1-2.72.37,6.28,6.28,0,0,1-3.23-.74,4.29,4.29,0,0,1-1.89-2.81q-2.45,3.64-8,3.64A11,11,0,0,1,205.87,32.81ZM210,19.06a7,7,0,0,0-2,5.07,7,7,0,0,0,2,5.07,6.54,6.54,0,0,0,4.91,2,7,7,0,0,0,7.1-7.1,7,7,0,0,0-7.1-7.1A6.55,6.55,0,0,0,210,19.06Z"
        />
        <path
          class="cls-1"
          d="M200.12,12a11,11,0,0,0-1.2-.07A10.91,10.91,0,0,0,188,22.81v13.1h5.49V23.69a6.09,6.09,0,0,1,1.71-4.54,6.22,6.22,0,0,1,4.57-1.68h.35Z"
        />
        <path
          class="cls-1"
          d="M163,36a6.18,6.18,0,0,0-.73-3.09A4.3,4.3,0,0,0,159.45,31h0V22.81A10.9,10.9,0,0,0,149.81,12h0l-.48,0h-.06l-.66,0h-.07l-.66,0h-.06l-.48,0h0a10.9,10.9,0,0,0-9.65,10.84V31a4.3,4.3,0,0,0-2.82,1.89,6.18,6.18,0,0,0-.73,3.09s0,.09,0,.14a7.7,7.7,0,0,0,.37,2.72H139a8.27,8.27,0,0,1-.09-1.15,1.43,1.43,0,0,1,.62-1.31,4.14,4.14,0,0,1,2.1-.39h13.92a4.14,4.14,0,0,1,2.1.39,1.43,1.43,0,0,1,.62,1.31,8.27,8.27,0,0,1-.09,1.15h4.47a7.7,7.7,0,0,0,.37-2.72S163,36,163,36Zm-14.41-5h-5.41V23.69a6.09,6.09,0,0,1,1.71-4.54,5.4,5.4,0,0,1,1-.81,5.19,5.19,0,0,1,5.27,0,5.4,5.4,0,0,1,1,.81A6.09,6.09,0,0,1,154,23.69V31Z"
        />
        <text class="cls-2" transform="translate(76.17 67.01)">
          яр
          <tspan class="cls-3" x="20.44" y="0">к</tspan>
          <tspan x="29.82" y="0">ое</tspan>
          <tspan x="0" y="19.19">а</tspan>
          <tspan class="cls-4" x="9.6" y="19.19">г</tspan>
          <tspan class="cls-5" x="16.69" y="19.19">ен</tspan>
          <tspan class="cls-3" x="37.56" y="19.19">т</tspan>
          <tspan x="45.88" y="19.19">ство</tspan>
          <tspan x="0" y="38.37">недвижи</tspan>
          <tspan class="cls-6" x="78.23" y="38.37">м</tspan>
          <tspan x="91.48" y="38.37">ости</tspan>
        </text>
      </g>
    </g>
  </svg>
</a>

<div class="menu back menu--4">
  <label>
    <input type="checkbox" />
    <svg id="menu" viewBox="0 0 100 100" xmlns="http://www.w3.org/2000/svg">
      <path class="line--1" d="M0 55l14-10c4.7-3.3 9-5 13-5h72" />
      <path class="line--2" d="M0 50h99" />
      <path class="line--3" d="M0 45l14 10c4.7 3.3 9 5 13 5h72" />
    </svg>
  </label>
</div>

        <?= $content ?>

        <?php 
          Modal::begin([
            'header' => '<h2>Ваша заявка</h2>',
            'id' => 'contact__form',
            'size' => 'modal-lg',
            'footer' => '
            <button type="button" class="btn btn-default" data-dismiss="modal">Добавить еще объект</button>
            <button type="button" class="btn btn-success clear-print" onClick="Print(\'printList\');">Отправить заявку</button>
            <button type="button" class="btn btn-danger clear-print" onclick="clearPrint()">Очистить список</button>
            '
          ]);

          Modal::end();
        ?>

<?php $this->endBody() ?>
</body>
</html>
<?php $this->endPage() ?>